## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397logs"
        name                              = "findatppr397logs"
        tags                              = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.57.70.176",
              + "13.89.26.210",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-397applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-397httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights_standard_web_test.web_app_service[0] will be updated in-place
  ~ resource "azurerm_application_insights_standard_web_test" "web_app_service" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/webTests/find-a-tp-pr-397-http"
        name                    = "find-a-tp-pr-397-http"
        tags                    = {
            "Environment"                                                                                                                                                         = "pr-397"
            "Product"                                                                                                                                                             = "National Tutoring Programme"
            "Service Offering"                                                                                                                                                    = "National Tutoring Programme"
            "hidden-link:/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/components/find-a-tp-pr-397-insights" = "Resource"
        }
        # (10 unchanged attributes hidden)

      ~ request {
          ~ url                              = "https://find-a-tp-pr-397-cdnendpoint-c2a2hahrefewdaaj.z01.azurefd.net/health" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_endpoint.endpoint[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      ~ cdn_frontdoor_profile_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn" # forces replacement -> (known after apply) # forces replacement
      ~ host_name                = "find-a-tp-pr-397-cdnendpoint-c2a2hahrefewdaaj.z01.azurefd.net" -> (known after apply)
      ~ id                       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/afdEndpoints/find-a-tp-pr-397-cdnendpoint" -> (known after apply)
        name                     = "find-a-tp-pr-397-cdnendpoint"
        tags                     = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_firewall_policy.waf[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_firewall_policy" "waf" {
      ~ frontend_endpoint_ids             = [] -> (known after apply)
      ~ id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/findatppr397waf" -> (known after apply)
        name                              = "findatppr397waf"
      ~ sku_name                          = "Standard_AzureFrontDoor" -> "Premium_AzureFrontDoor" # forces replacement
        tags                              = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (5 unchanged attributes hidden)

      ~ custom_rule {
            name                           = "RateLimiting"
            # (6 unchanged attributes hidden)

          ~ match_condition {
              - transforms         = [] -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin.origin[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_origin" "origin" {
      ~ cdn_frontdoor_origin_group_id  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/originGroups/find-a-tp-pr-397-origingroup" # forces replacement -> (known after apply) # forces replacement
      ~ health_probes_enabled          = true -> (known after apply)
      ~ id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/originGroups/find-a-tp-pr-397-origingroup/origins/find-a-tp-pr-397origin" -> (known after apply)
        name                           = "find-a-tp-pr-397origin"
        # (8 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_origin_group.group[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_origin_group" "group" {
      ~ cdn_frontdoor_profile_id                                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn" # forces replacement -> (known after apply) # forces replacement
      ~ id                                                        = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/originGroups/find-a-tp-pr-397-origingroup" -> (known after apply)
        name                                                      = "find-a-tp-pr-397-origingroup"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_profile.cdn[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_profile" "cdn" {
      ~ id                       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn" -> (known after apply)
        name                     = "find-a-tp-pr-397-cdn"
      ~ resource_guid            = "cd1a0882-02af-44ba-8e67-16e455297cb6" -> (known after apply)
      ~ sku_name                 = "Standard_AzureFrontDoor" -> "Premium_AzureFrontDoor" # forces replacement
        tags                     = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (2 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_route.route[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_route" "route" {
      - cdn_frontdoor_custom_domain_ids = [] -> null
      ~ cdn_frontdoor_endpoint_id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/afdEndpoints/find-a-tp-pr-397-cdnendpoint" # forces replacement -> (known after apply) # forces replacement
      ~ cdn_frontdoor_origin_group_id   = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/originGroups/find-a-tp-pr-397-origingroup" -> (known after apply)
      ~ cdn_frontdoor_origin_ids        = [
          - "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/originGroups/find-a-tp-pr-397-origingroup/origins/find-a-tp-pr-397origin",
        ] -> (known after apply)
      - cdn_frontdoor_rule_set_ids      = [] -> null
      ~ id                              = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/afdEndpoints/find-a-tp-pr-397-cdnendpoint/routes/find-a-tp-pr-397route" -> (known after apply)
        name                            = "find-a-tp-pr-397route"
        # (6 unchanged attributes hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_cdn_frontdoor_security_policy.waf[0] must be replaced
-/+ resource "azurerm_cdn_frontdoor_security_policy" "waf" {
      ~ cdn_frontdoor_profile_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/securityPolicies/findatppr397wafsecuritypolicy" -> (known after apply)
        name                     = "findatppr397wafsecuritypolicy"

      ~ security_policies {
          ~ firewall {
              ~ cdn_frontdoor_firewall_policy_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/findatppr397waf" # forces replacement -> (known after apply) # forces replacement

              ~ association {
                    # (1 unchanged attribute hidden)

                  ~ domain {
                      ~ active                  = true -> (known after apply)
                      ~ cdn_frontdoor_domain_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn/afdEndpoints/find-a-tp-pr-397-cdnendpoint" # forces replacement -> (known after apply) # forces replacement
                    }
                }
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_function_app.default will be updated in-place
  ~ resource "azurerm_linux_function_app" "default" {
      ~ app_settings                      = {
          - "BlobStorageEnquiriesData__AccountName"   = "s177p01enquiriesdata"
          - "BlobStorageEnquiriesData__ClientId"      = "10e39e46-b948-4cd9-ac27-90dc6e4bd472"
          - "BlobStorageEnquiriesData__ContainerName" = "ntp-enquiries-data-pr"
          - "BlobStorageEnquiriesData__TenantId"      = "9c7d9dd3-840c-4b3f-818e-552865082e16"
          - "DataExtractionTimerCronExpression"       = "1 1 * * *"
          - "FatpAzureKeyVaultName"                   = "find-a-tp-pr-397-kv"
          - "PollEmailProcessingUrl"                  = "https://find-a-tp-pr-397-cdnendpoint-c2a2hahrefewdaaj.z01.azurefd.net/admin/process-emails"
        } -> (known after apply)
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Web/sites/find-a-tp-pr-397-fa"
        name                              = "find-a-tp-pr-397-fa"
      ~ tags                              = {
            "Environment"                                    = "pr-397"
            "Product"                                        = "National Tutoring Programme"
            "Service Offering"                               = "National Tutoring Programme"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=a62f6f74-0834-4b9a-a044-ad11b2332bef;IngestionEndpoint=https://westeurope-5.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "a62f6f74-0834-4b9a-a044-ad11b2332bef" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/microsoft.insights/components/find-a-tp-pr-397-insights-fa" -> null
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string  = (sensitive value) -> null
          - application_insights_key                = (sensitive value) -> null
          ~ ip_restriction                          = [
              ~ {
                  ~ headers                   = [
                      ~ {
                          ~ x_azure_fdid      = [
                              - "cd1a0882-02af-44ba-8e67-16e455297cb6",
                            ] -> (known after apply)
                            # (3 unchanged attributes hidden)
                        },
                    ]
                    name                      = "Allow CDN Traffic"
                    # (5 unchanged attributes hidden)
                },
            ]
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Web/sites/find-a-tp-pr-397"
        name                              = "find-a-tp-pr-397"
        tags                              = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ site_config {
          ~ ip_restriction                          = [
              ~ {
                  ~ headers                   = [
                      ~ {
                          ~ x_azure_fdid      = [
                              - "cd1a0882-02af-44ba-8e67-16e455297cb6",
                            ] -> (known after apply)
                            # (3 unchanged attributes hidden)
                        },
                    ]
                    name                      = "Allow CDN Traffic"
                    # (5 unchanged attributes hidden)
                },
            ]
            # (24 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-397-kv|find-a-tp-pr-397-default-kv-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-default-kv-diag"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cache/redis/find-a-tp-pr-397-redis-cache|find-a-tp-pr-397-default-redis-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-default-redis-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.function_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "function_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397falogs|find-a-tp-pr-397-storage-diag-fa"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-storage-diag-fa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397logs|find-a-tp-pr-397-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Logic/workflows/find-a-tp-pr-397-webhook-workflow|find-a-tp-pr-397-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-397-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.latency[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "latency" {
        id                   = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-397-cdn-latency"
        name                 = "find-a-tp-pr-397-cdn-latency"
      ~ scopes               = [
          - "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Cdn/profiles/find-a-tp-pr-397-cdn",
        ] -> (known after apply)
        tags                 = {
            "Environment"      = "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397"
        name     = "s177d01-ntp-pr-397"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-397"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-397/providers/Microsoft.Storage/storageAccounts/findatppr397logs"
      ~ ip_rules                   = [
          - "13.89.26.210",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 11 to change, 7 to destroy.
```
</details>